rtsbd/scenario3/canceldeadlineRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rts="http://www.rts.co.kr/">
<soapenv:Header>
   <rts:BaseInfo>
      <!--Optional:-->
      <rts:SiteCode>CTM1X-00</rts:SiteCode>
      <!--Optional:-->
      <rts:Password>test1234</rts:Password>
      <!--Optional:-->
      <rts:RequestType>NetPartner</rts:RequestType>
   </rts:BaseInfo>
</soapenv:Header>
<soapenv:Body>
   <rts:GetCancelDeadlineForCustomerCount>
      <rts:GetCancelDeadline>
         <!--Optional:-->
         <rts:ItemCode>SAO0037</rts:ItemCode>
         <rts:ItemNo>16</rts:ItemNo>
         <!--Optional:-->
         <rts:RoomTypeCode>20200416|20200419|W|258|47369|SUI.SU|GAR|BB||1~1~0||N@04~~246c3~-513337453~N~~927FE06EFE78440157909834038802PAAR00000580026000508246c3^20200416|20200419|W|258|47369|SUI.SU|GAR|BB||1~1~1|6|N@04~~246c3~-1117434062~N~~927FE06EFE78440157909834038802PAAR00000580026000508246c3:DJB.EA:suite single twin superior:258|17368|431:A1#B0#C0#D0#E0|DHBRGPB|~Breakfast</rts:RoomTypeCode>
         <!--Optional:-->
         <rts:CheckInDate>2020-04-16</rts:CheckInDate>
         <!--Optional:-->
         <rts:CheckOutDate>2020-04-19</rts:CheckOutDate>
         <!--Optional:-->
         <rts:GuestList>
            <!--Zero or more repetitions:-->
            <rts:GuestsInfo>
               <rts:AdultCount>1</rts:AdultCount>
               <rts:ChildCount>0</rts:ChildCount>
               <rts:RoomCount>1</rts:RoomCount>
               <rts:ChildAge1>0</rts:ChildAge1>
               <rts:ChildAge2>0</rts:ChildAge2>
            </rts:GuestsInfo>
            <rts:GuestsInfo>
               <rts:AdultCount>1</rts:AdultCount>
               <rts:ChildCount>1</rts:ChildCount>
               <rts:RoomCount>1</rts:RoomCount>
               <rts:ChildAge1>6</rts:ChildAge1>
               <rts:ChildAge2>0</rts:ChildAge2>
            </rts:GuestsInfo>
         </rts:GuestList>
         <!--Optional:-->
         <rts:LanguageCode>AR</rts:LanguageCode>
         <!--Optional:-->
         <rts:TravelerNationality>AR</rts:TravelerNationality>
      </rts:GetCancelDeadline>
   </rts:GetCancelDeadlineForCustomerCount>
</soapenv:Body>
</soapenv:Envelope>